<template>
  <div class="container-fluid light-color">
    <app-text-block title="Как принять участие">
      <p>
        Каждый хозяин кошки считает своего питомца уникальным. Однако не каждый
        владелец знает, что он может показывать его на специальных мероприятиях.
        Для участия в выставке нужно выполнить определённые условия, а также
        подготовить необходимые документы. Обязательно учитываются состояние
        здоровья животного и возраст.
      </p>
    </app-text-block>
    <div class="container pb-4">
      <app-card-horizontal title="Возраст" imgIsRight img="age.jpg">
        <div class="text-md-end">
          <hr />
          <p>
            Для того чтобы принять участие в выставке, котёнок должен быть
            старше 4 месяцев.
          </p>
          <p>
            Если в дальнейшем планируется разведение породы, то рекомендуется
            брать на выставку животное старше 10 месяцев.
          </p>
          <p>
            Предела возраста для участия животного в выставке нет, однако брать
            с собой кошку старше 10 лет на мероприятие не рекомендуется.
          </p>
        </div>
      </app-card-horizontal>
      <app-card-horizontal title="Здоровье" img="health.jpg">
        <hr />
        <ul>
          <li>
            Выставочная кошка должна быть здорова и вакцинирована от зоонозных
            инфекций.
          </li>
          <li>
            До размещения в выставочном зале кошка должна пройти ветеринарный
            контроль.
          </li>
          <li>
            Наличие микрочипа у животного не является обязательным условием
            участия в выставке
          </li>
          <li>
            У владельца обязательно должны быть ветеринарный паспорт животного,
            ветеринарный сопроводительный документ;
          </li>
        </ul>
        <p><b>Важно: </b> ветеринарные справки действительны 5 дней.</p>
      </app-card-horizontal>
    </div>
  </div>
  <div class="container-fluid darl-color">
    <app-text-column>
      <template #right-column>
        <h2>Регистрация</h2>
        <p>пройдите предварительную регистрацию</p>
      </template>
      <template #left-column>
        <p>
          Если же вы убеждены, что именно ваша кошка будущая звездочка –
          пройдите предварительную регистрацию участника на
          <router-link :to="{ path: '/main', hash: '#regist' }"
            ><b>главной странице сайта.</b></router-link
          >
          После этого с вами свяжутся организаторы.
        </p>
        <p>
          Начинайте собирать документы и подготавливать кошку к выставке. Теперь
          вы должны осознать, что берете на себя некоторые обязанности и
          финансовые затраты.
        </p>
      </template>
    </app-text-column>
  </div>
  <div class="container-fluid light-color">
    <app-text-column>
      <template #right-column>
        <h2>Документы</h2>
        <p>необходимо иметь при себе оригиналы или электронные копии</p>
      </template>
      <template #left-column>
        <ul>
          <li>
            Ветпаспорт. Такой документ является попуском на выставку и должен
            содержать информацию обо всех прививках животного.
          </li>
          <li>
            Справка №1. Данный документ содержит сведения о санитарной
            обстановке района проживания (только для иногородних).
          </li>
          <li>
            Справка №4. Такую бумагу выдаёт доктор на основе ветеринарного
            паспорта и после осмотра питомца. Это своеобразное заключение о
            здоровье животного.
          </li>
          <li>
            Заполненная заявка на участие. Шаблон можно скачать
            <!-- ссылка на шаблон -->
            <a target="_blank"><b>здесь</b></a>
          </li>
        </ul>
      </template>
    </app-text-column>
  </div>
  <div class="container-fluid darl-color">
    <app-text-column>
      <template #right-column>
        <h2>Что нужно иметь при себе</h2>
        <p>подготовьте все необходимые средства заранее</p>
      </template>
      <template #left-column>
        <ul>
          <li>
            металлическую клетку с занавесками — важно обратить внимание на
            оформление, т. к. это дополнительный балл на конкурсе
          </li>
          <li>
            подстилку — лучше всего отдавать предпочтение плотному и
            натуральному материалу
          </li>
          <li>лоток и наполнитель для туалета</li>
          <li>две миски, корм и вода</li>
          <li>2-3 игрушки</li>
          <li>антисептические салфетки</li>
        </ul>
      </template>
    </app-text-column>
  </div>
  <div class="container-fluid light-color p-5">
    <div class="container">
      <app-card-horizontal title="Завершение выставки" img="final.jpg">
        <p>
          Каждый участник получает сертификат об участии в выставке (диплом).
          Выдача дипломов до окончания финального конкурса выставки "Картонная
          коробка" не производится. Если вы покидаете выставку до ее окончания,
          получить диплом можно после окончания выставки в течение года, вы
          можете запросить организаторов выслать диплом в электронной форме.
        </p>
        <p>
          Каждый участник должен оставить после себя чистоту и порядок. Не
          забывайте своих животных, вещи и подарки.
        </p>
      </app-card-horizontal>
    </div>
  </div>
</template>

<script>
import AppTextBlock from '@/components/AppTextBlock.vue';
import AppCardHorizontal from '@/components/AppCardHorizontal.vue';
import AppTextColumn from '@/components/AppTextColumn.vue';
export default {
  components: { AppTextBlock, AppCardHorizontal, AppTextColumn },
};
</script>

<style></style>
